{
    "races": [
        {
            "name": "Star Elf",
            "major_trait": {
                "name": "Elven Ears",
                "description": "You make your Detect Skill Roll with Edge to listen. When you close your eyes for 12 seconds (1 round), everything you hear within 10m (1 zone) of you will appear as vividly to you as if you are looking directly at it, even through walls. You can even read the content of a note being written by listening to the sound of the scribbling, or the shape of the writing if you don’t understand the language. You can also perceive invisible creatures that are corporeal within 10m (1 zone)."
            },
            "minor_trait": {
                "name": "Mental Compass",
                "description": "You always know which direction is North and the paths you have taken. You can only get lost if affected by spells or curses."
            },
            "description": "Elves are natural academics with a long lifespan, distinguished by their Elven Ears and ability to stay awake without sleep. They have two subraces, Sun Elves and Star Elves, which alter their minor traits."
        },
        {
            "name": "Sun Elf",
            "major_trait": {
                "name": "Elven Ears",
                "description": "You make your Detect Skill Roll with Edge to listen. When you close your eyes for 12 seconds (1 round), everything you hear within 10m (1 zone) of you will appear as vividly to you as if you are looking directly at it, even through walls. You can even read the content of a note being written by listening to the sound of the scribbling, or the shape of the writing if you don’t understand the language. You can also perceive invisible creatures that are corporeal within 10m (1 zone)."
            },
            "minor_trait": {
                "name": "Sleepless",
                "description": "You do not require sleep. When resting, you can do other light activities such as keeping watch or reading instead. You can instinctually tell time to the nearest minute and accurately predict the weather for the next 24 hours."
            },
            "description": "Elves are natural academics with a long lifespan, distinguished by their Elven Ears and ability to stay awake without sleep. They have two subraces, Sun Elves and Star Elves, which alter their minor traits."
        },
        {
            "name": "Dwarf",
            "major_trait": {
                "name": "Natural Magnetism",
                "description": "You can magnetically levitate metallic objects within 10m (1 zone) of you. The object can’t be heavier than 1kg and you can move it freely within the 10m (1 zone) range. You can also magnetize your body to attach up to 1kg of metal to yourself."
            },
            "minor_trait": {
                "name": "Smell Metal",
                "description": "You can smell metal within 10m (1 zone) of you, even when it’s underground or buried within other objects. You can tell the general size, shape, and type of the metal and whether it is a crafted product such as a weapon or raw metal ore."
            },
            "description": "Dwarves are skilled miners with a stout frame and distinctive metal bands on their noses. They have a natural affinity for magnets and can smell metal."
        },
        {
            "name": "Paracelian",
            "major_trait": {
                "name": "Squeeze",
                "description": "You can squeeze through gaps with your liquid-like body and extend it up to 2 meters away from your holding gem. Your holding gem is a solid 15cm wide polyhedral gem located on your forehead."
            },
            "minor_trait": {
                "name": "Mimic Shape",
                "description": "You can perfectly mimic the physical shape of a Medium sized or Small sized creature or object you saw within the last 24 hours. If you mimic a physical key, that key is usable. However, you cannot change the color of your body."
            },
            "description": "Paracelians are amorphous para-elementals with translucent bodies attached to a holding gem. They can squeeze through gaps and mimic the shape of other creatures or objects."
        },
        {
            "name": "Faunalian",
            "average_lifespan": "50 - 120 years",
            "major_trait": {
                "name": "Animal Aspect",
                "description": "Choose a combination of two of the following sub traits:",
                "traits": [
                    {
                        "name": "Aquatic",
                        "description": "You can breathe underwater and don’t suffer any action penalties when moving in water. You also have Edge on all your Sports Rolls in water."
                    },
                    {
                        "name": "Camouflage",
                        "description": "Using a minor action, you can mimic the colors of your surroundings within 10m (1 zone). While mimicking and remaining stationary, you make your Thievery Skill Rolls with Edge to hide. Alternatively, you can use this sub trait to capture an image on one of your body parts. This mimicry lasts for 24 hours or until you dismiss it with your minor action."
                    },
                    {
                        "name": "Climber’s Body",
                        "description": "Your Sports Skill Rolls to climb are made with Edge and you start taking fall damage only after falling at least 20m (2 zones)."
                    },
                    {
                        "name": "Drop Tail",
                        "description": "You can detach your tail using your minor action. Your severed tail is considered to be the same entity as you when it comes to detection spells or effects, and can be used as a decoy. You have Edge on your Deception Roll to make your pursuers chase your tail instead. It takes 7 in-game days to fully regrow your tail or after the end of a mission or chapter. During an emergency, your tail serves as 3 portions’ worth of rations."
                    },
                    {
                        "name": "Creature Chatter",
                        "description": "Using gestures, grunts, and various other means, you can converse with any creature that has the 'animal' type even if it’s not capable of speech. You can even use the Reason Skill on animals now."
                    },
                    {
                        "name": "Echolocation",
                        "description": "By clicking your tongue, you can auditorily detect the distance of walls, objects, and corporeal creatures up to 20m away. The clicking is audible from 20m away. You also roll with Edge to Detect things by hearing."
                    },
                    {
                        "name": "Hunter’s Eyes",
                        "description": "You roll with Edge to Detect things by sight and your sight cannot be hindered by darkness. This trait does not allow you to see through darkness created by magic."
                    },
                    {
                        "name": "Pouch",
                        "description": "You can store 1 Item Slot’s worth of items on your body. Your pouch could be in your cheek, belly, or any other place your imagination dares to venture."
                    },
                    {
                        "name": "Tracker’s Nose",
                        "description": "You can memorize a scent you have smelled in the past perfectly. You roll with Edge to Detect things by scent."
                    }
                ]
            },
            "minor_trait": {
                "name": "Creature Chatter",
                "description": "Using gestures, grunts, and various other means, you can converse with any creature that has the 'animal' type even if it’s not capable of speech. You can even use the Reason Skill on animals now."
            },
            "description": "Faunalians are descendants of illuminated beasts who transformed into a sapienoid form. They often retain animalistic features like ears and tails, with inherited traits from various animal ancestors."
        },
        {
            "name": "Floralian",
            "average_lifespan": "80 - 430 years",
            "major_trait": {
                "name": "Commune With Nature",
                "description": "Using your minor action, you can borrow the sense of touch and hearing of all plants within 100m (10 zones) of you. You can use the plant’s limited senses to hear sounds within 10m (1 zone) of the plant and identify the shape of creatures touching or standing on the plant. While using this feature, you cannot move or use your own senses. When activated, this feature lasts for 10 minutes. You can end it early with your minor action. You can use this trait once and it’s reusable after taking a Long Break or Full Rest."
            },
            "minor_trait": {
                "name": "Sample Test",
                "description": "Using your minor action, you can snap off a piece of your branch to test the effects of spells, hazards, or unidentified substances without having them affect you directly. The test tells you all the beneficial or negative effects. Floralians often use this trait to identify the effects of curses, traps, or unlabeled potions."
            },
            "description": "Floralian sapienoids originated from illuminated plants that fought against scourging fiends. They have a plant-like appearance with bark-like skin and may have crowns of branches on their heads, derived from various plant species."
        },
        {
            "name": "Artificium Arma",
            "average_lifespan": "1 - ??? Years",
            "description": "Artificiums are beings born from objects infused with powerful dreams, hopes, and spirits, attracting souls to inhabit them and granting them life. These rare entities cannot reproduce or evolve in the traditional sense but are considered living beings nonetheless. Found mostly in the peaks of Illum where cosmic laws are potent, Artificiums can morph parts of their bodies into tools, store weapons within themselves, and even empathize with objects to experience their memories.",
            "major_trait": {
                "name": "Living Toolbox",
                "description": "You can morph part of your body into any type of Toolkit and use it for a single Task Roll. The Toolkit’s Quality Bonus is the same as your Mastery Bonus. You can use this trait once and it’s reusable after taking a Long Break or Full Rest."
            },
            "minor_trait": {
                "name": "Weapon Eater",
                "description": "Using your minor action, you can swallow 1 Item Slot’s worth of weaponry and store it in a separate compartment in your body. You can turn your body parts into your swallowed weapons as a Free Action when you enter combat and use them as normal. Swapping weapons still requires a minor action, and you require Mastery in the weapon to get the Mastery Bonus. You can regurgitate the weapon with a minor action."
            }
        },
        {
            "name": "Artificium Instrumentum",
            "average_lifespan": "1 - ??? Years",
            "description": "Artificiums are beings born from objects infused with powerful dreams, hopes, and spirits, attracting souls to inhabit them and granting them life. These rare entities cannot reproduce or evolve in the traditional sense but are considered living beings nonetheless. Found mostly in the peaks of Illum where cosmic laws are potent, Artificiums can morph parts of their bodies into tools, store weapons within themselves, and even empathize with objects to experience their memories.",
            "major_trait": {
                "name": "Living Toolbox",
                "description": "You can morph part of your body into any type of Toolkit and use it for a single Task Roll. The Toolkit’s Quality Bonus is the same as your Mastery Bonus. You can use this trait once and it’s reusable after taking a Long Break or Full Rest."
            },
            "minor_trait": {
                "name": "Object Empathy",
                "description": "When you touch an object, you can experience part of its memory. You know the name and physical features of its owner and the last person besides yourself who touched it within the last 24 hours. You can use this trait once, and it’s reusable after taking a Long Break or Full Rest."
            }
        },
        {
            "name": "Oni",
            "average_lifespan": "80 years",
            "description": "Onis, originally reclusive inhabitants of Sanctum, adapted to the Cloudfall's challenges by intermarrying with angels and asuras. They developed the ability to manifest spectral masks over their faces, obscuring their identities. These masks can be personalized, serving as a means of cultural and personal expression among clans or groups. Onis also possess the ability to meld with shadows, enhancing their stealth capabilities.",
            "major_trait": {
                "name": "Sigil Mask",
                "description": "Using your minor action, you can manifest an illusory mask of your design over your face. While this mask is manifested, no one can read your emotions or remember any details about you, such as your physical features, clothing, and voice. All they can remember is your mask pattern. Psychology Skill Rolls made against you while you have your mask on automatically fail. You can dismiss the mask or change its pattern using your minor action."
            },
            "minor_trait": {
                "name": "Shadow Meld",
                "description": "You can make Thievery Skill Rolls with Edge to sneak and hide when the sun is not in the sky."
            }
        },
        {
            "name": "Asura",
            "average_lifespan": "80 years",
            "description": "Asuras arrived in Sanctum as mercenaries during the Cloudfall but became stranded due to the undead legion's expansion. Over time, they integrated into Sanctumite society, losing physical arms to gain spectral arms that can perform intricate mudras (hand signs) known only to their clans. Asuras also possess the ability to sense violence within their vicinity, attuned to disturbances caused by combat or bloodshed.",
            "major_trait": {
                "name": "Phantom Arms",
                "description": "You have four phantom arms and you can toggle their visibility with your minor action. While invisible, you can make Thievery Skill Rolls with Edge to pickpocket using them. While visible, you make all your Brute Skill Rolls with Edge. You can only use a pair of your arms effectively in combat. You can use your minor action to switch to which 2 out of your 6 arms to use in combat."
            },
            "minor_trait": {
                "name": "Sense Violence",
                "description": "Using your minor action, you can sense if there was a fight or bloodshed within 30m (3 zones) of you in the last 24 hours. You know the rough number of the participants hurt or killed."
            }
        },
        {
            "name": "Messenger Angel",
            "average_lifespan": "80 years",
            "description": "Messengers among angels descended from Avalon during the Cloudfall, losing their ability to fly and gaining spectral wings and halos. They embody traits of swift movement and communication, utilizing their descent ability to mitigate fall damage and emitting light from their halos. They can manifest bright light around them and possess the unique trait 'Light Halo' to illuminate their surroundings.",
            "major_trait": {
                "name": "Angel’s Descent",
                "description": "You can use your Free Action to instantly slow the speed of your fall and not take fall damage. (You will take fall damage if you’re prevented from taking action by certain conditions and effects)"
            },
            "minor_trait": {
                "name": "Light Halo",
                "description": "Using your minor action, you can emit 30m of bright light from your halo and spectral wings. You can also turn off the light with a minor action."
            }
        },
        {
            "name": "Charioteer Angel",
            "average_lifespan": "80 years",
            "description": "Charioteers among angels are rarer than messengers, embodying leadership and protection qualities. They have the ability 'Be Not Afraid' to summon rings of light that enable omnidirectional vision and prevent lying within a radius. Like all angels, they can emit bright light from their halos and wings. Their unique abilities make them formidable leaders and protectors within Sanctum.",
            "major_trait": {
                "name": "Be Not Afraid",
                "description": "Using your minor action, you can summon rings of light lined with countless rows of eyes to appear around you. While these rings are present, you can see in all directions around you at the same time, and no creatures can speak a lie within a 30m radius of you. This effect lasts for five minutes, and you can end it early by using your minor action."
            },
            "minor_trait": {
                "name": "Light Halo",
                "description": "Using your minor action, you can emit 30m of bright light from your halo and spectral wings. You can also turn off the light with a minor action."
            }
        },
        {
            "name": "Orc",
            "average_lifespan": "70 years",
            "major_trait": {
                "name": "Hardy",
                "description": "You can carry 2 additional Item Slots’ worth of items."
            },
            "minor_trait": {
                "name": "Explosive Voice",
                "description": "When you shout at the top of your lungs, you can make your Intimidation Skill Rolls with Edge. But all creatures within a 1 km radius can hear you."
            },
            "description": "It takes a special kind of bloody-mindedness to survive the desolate wildlands of Ulruk. Orcs not only survived but thrived, often assuming leadership roles in warbands. They are distinguished by their greenish-blue skin and natural resilience."
        },
        {
            "name": "Picker Goblin",
            "average_lifespan": "50 years",
            "major_trait": {
                "name": "Fearless",
                "description": "Intimidation Skill Rolls made against you automatically fail and you are immune to being Frightened and fear related effects."
            },
            "minor_trait": {
                "name": "Play Dead",
                "description": "You can pretend to be dead at will. While doing so, all of your life signs are imperceptible by normal means. Your ruse can only be uncovered by features and magic."
            },
            "extra_trait": {
                "name": "Small",
                "description": "Your size is Small. Smaller sized units make Cheap Shot Maneuver Rolls with Edge against larger units. But larger units make Scuffle Maneuver Rolls with Edge against smaller units."
            },
            "description": "Picker Goblins in Ulruk are adept scavengers, known for their ability to play dead convincingly and fearless nature. They are small in stature and crucial to technological innovations in Ulruk."
        },
        {
            "name": "Ticker Goblin",
            "average_lifespan": "50 years",
            "major_trait": {
                "name": "Fearless",
                "description": "Intimidation Skill Rolls made against you automatically fail and you are immune to being Frightened and fear related effects."
            },
            "minor_trait": {
                "name": "Mechanical Affinity",
                "description": "While remaining still and not making any noise, you can hear the faintest clicks & whirrs of any machinery and construct that’s currently active within 30m. You know their exact number and locations."
            },
            "extra_trait": {
                "name": "Small",
                "description": "Your size is Small. Smaller sized units make Cheap Shot Maneuver Rolls with Edge against larger units. But larger units make Scuffle Maneuver Rolls with Edge against smaller units."
            },
            "description": "Ticker Goblins in Ulruk are skilled mechanics, driving technological advancements with their innate affinity for machinery. They are small and agile, often tinkering with gadgets and devices."
        },
        {
            "name": "Troll",
            "average_lifespan": "90 years",
            "major_trait": {
                "name": "Static Sense",
                "description": "Your hair is sensitive to the slightest movement of air and static electricity. You can use your minor action to detect the presence of creatures around you and the size of the largest one. This trait works on invisible creatures but not on incorporeal creatures."
            },
            "minor_trait": {
                "name": "Sturdy",
                "description": "You can make Endurance Skill Rolls with Edge when your body is exposed to sunlight."
            },
            "description": "Trolls in Ulruk are valued for their sensitivity to environmental changes, making them excellent scouts. They have stone-like patches on their skin and hair that reacts to static and air movements."
        },
        {
            "name": "Human",
            "average_lifespan": "70 years",
            "major_trait": {
                "name": "Specialist",
                "description": "You get an additional Toolkit Mastery during character creation."
            },
            "minor_trait": {
                "name": "Traveler",
                "description": "You can carry 1 additional Item Slot’s worth of items."
            },
            "description": "Humans emerged mysteriously after the collapse of the cloud wall during Cloudbreak. They quickly adapted to become versatile traders and laborers across the four regions, remaining politically neutral."
        },
        {
            "name": "Armgeist",
            "average_lifespan": "- years",
            "major_trait": {
                "name": "Armgeist Possession",
                "description": "You start the game in a weapon form of your choice, such as a longsword, a bow, or other mundane weapons on the weapon list in Chapter 9, that are neither machinarm nor spiritarm. Then, choose a Lifeform or custom Lifeform to be your host. You can use their Lifeform Traits and control them as your own body while they’re within 10m (1 zone) of you. You still need the relevant Mastery to wield your weapon form.\n\nYour host Lifeform can be a corpse or someone who has willingly let you take complete control over their body. Your statistics, Masteries, and personality overwrite that person’s abilities. You cannot access their memory, but you may communicate with the willing host’s mind and personality if it’s still alive. If your host is reduced to 0 Resolve, you shatter while leaving your host barely alive. The revival process is the same, except that you need to have a host and spend an extra 100 Cred to hire a blacksmith.\n\nAs a weapon or a set of weapons, you occupy Item Slots as normal. You cannot be Disarmed unless you allow it. If you are placed 10m (1 zone) away from your host, the host will collapse into a lifeless puppet. After 24 hours, you will lose control of the body and shatter. As a disembodied armgeist, you can still see, hear, and communicate telepathically with creatures touching you."
            },
            "minor_trait": {
                "name": "Living Weapon",
                "description": "You can use your Major Action to fold your host’s body and inventory into you and let yourself be wielded by another PC or NPC in the same zone as you. You need to be in weapon form and your wielder needs the proper Mastery to wield the weapon form you assume. You retain your HP, MP, Resolve, Defense, and Fortitudes and are considered as a separate target on the same unit.\n\nWhile being wielded, with your wielder’s consent, you can use your own actions to control your wielder on your own turn as if you were controlling that character. You can also use your own actions to activate the wielder’s instant features. You cannot use any of your own features or actions on yourself besides using your Major Action to return to your original form. You also transform back into your original form when you’re downed.\n\nWhile being wielded, you can use your minor action at any time to instantly transform into another weapon in your inventory and back to your original weapon form."
            },
            "description": "Armgeists are mysterious entities that inhabit the bodies of deceased creatures, fulfilling their hosts’ final wishes. They emerged as a phenomenon among the Cloudbreakers, wielding weapons and often returning from apparent death. Their origin remains unknown, and their ability to control hosts raises questions about their nature and purpose."
        },
        {
            "name": "Korpocle",
            "average_lifespan": "30 years",
            "major_trait": {
                "name": "Kor-Pocles",
                "description": "Your size category is Medium. You can split into three separate Very Small pocles or meld back into a single Korpocle. Each pocle acts independently but shares the same actions and resources."
            },
            "minor_trait": {
                "name": "Multi-Personality",
                "description": "You get 1 additional Quirk Point during character creation, starting with 3 instead of 2."
            },
            "description": "Korpocles are small, watermelon-sized sapienoids that can combine into a medium-sized form. Their origin is linked to legends of the Melus Islands and the magical properties of a dragon’s pearl."
        },
        {
            "name": "Dragoncast",
            "average_lifespan": "120 years",
            "major_trait": {
                "name": "Command Water",
                "description": "You have power over water, allowing you to walk on water, breathe underwater, and manipulate water with three uses of water command per Full Rest."
            },
            "minor_trait": {
                "name": "Majestic Horns",
                "description": "While a creature is within 10m of you and can clearly see your horn, you can roll Appeal against that creature with Edge."
            },
            "description": "Dragoncasts of the Melus Islands have long, scaly tails and majestic branched horns. They are protected by the Jade Shrine and have unique abilities tied to their ancient lineage."
        }
    ]
}